In [16]:
# 1. ðŸ“¦ Import Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from wordcloud import WordCloud
import nltk
import re


# Data Cleaning
# - Check nulls, duplicates
# - Standardize column names
# - Convert dates

# Exploratory Data Analysis (EDA)
# a. Job Titles: Most common job roles
# b. Locations: Where are the jobs?
# c. Company names frequency
# d. Posting trends over time
# e. Salary distribution (if available)

# NLP: Required Skills Analysis
# - Combine descriptions
# - Clean text
# - Word frequency or WordCloud

# Key Business Insights
# - Summary of findings
# - Suggestions for job seekers

# Export Visuals (optional)
# - Save figures to `images/` folder

# Save Report / Notebook Summary

# Visual settings
sns.set(style="whitegrid")
plt.rcParams['figure.figsize'] = (12, 6)

In [22]:
df = pd.read_csv('./data/indeed_uk_datascience_jobs_jan2024.csv')
df.head()

,positionName,salary,company,rating,reviewsCount,jobTypeConsolidated
0,Pricing Analyst,"Â£70,000 - Â£85,000 a year",Urban Empire Recruitment,NaN,NaN,"Permanent, Full-time"
1,Lead AI / ML / Data Science Engineer,"Â£150,000 a year",Founding Teams,NaN,NaN,Part-time
2,Data Scientist,NaN,Depop,4.4,34.0,Permanent
3,Research Fellow in data analysis and machine l...,NaN,UCL,4.1,256.0,"Permanent, Full-time"
4,Senior Data Scientist | Media & Entertainment.,"Â£70,000 a year",Nicholson Glover Consulting,NaN,NaN,Permanent

In [ ]:
# Check for missing values
df.isnull().sum()

# Drop columns with too many nulls (optionaxl)
df = df.dropna(thresh=len(df)*0.5, axis=1)

# Drop rows with critical missing values (like title, location)
df = df.dropna(subset=['title', 'company', 'location'])

# Reset index
df.reset_index(drop=True, inplace=True)

positionName             0
salary                 209
company                  0
rating                 114
reviewsCount           114
jobTypeConsolidated     78
dtype: int64